## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| update | `aws_glue_job.platform_gc_notify_job`                             |
|        | `aws_s3_object.platform_gc_notify_job`                            |
| add    | `aws_glue_catalog_database.platform_gc_notify_production_curated` |
|        | `aws_glue_job.platform_gc_notify_curated`                         |
|        | `aws_s3_object.platform_gc_notify_curated_job`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_glue_catalog_database.platform_gc_notify_production_curated will be created
  + resource "aws_glue_catalog_database" "platform_gc_notify_production_curated" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "CURATED: data source path /platform/gc-notify/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "platform_gc_notify_production_curated"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_job.platform_gc_notify_curated will be created
  + resource "aws_glue_job" "platform_gc_notify_curated" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--continuous-log-logGroup"          = "/aws-glue/jobs/encryption-at-rest/service-role/AWSGlueETL-DataLake/output"
          + "--continuous-log-logStreamPrefix"   = "platform_gc_notify_curated"
          + "--curated_bucket"                   = "cds-data-lake-curated-production"
          + "--curated_prefix"                   = "platform/gc-notify"
          + "--database_name_curated"            = "platform_gc_notify_production_curated"
          + "--database_name_transformed"        = "platform_gc_notify_production"
          + "--enable-auto-scaling"              = "true"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-glue-datacatalog"          = "true"
          + "--enable-job-insights"              = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--end_month"                        = " "
          + "--job-language"                     = "python"
          + "--start_month"                      = " "
          + "--target_env"                       = "production"
        }
      + glue_version           = "5.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + name                   = "Platform / GC Notify / Curated / Notification Enriched"
      + number_of_workers      = 2
      + role_arn               = "arn:aws:iam::739275439843:role/service-role/AWSGlueETL-DataLake"
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                = 15
      + worker_type            = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://cds-data-lake-glue-production/curated/platform/gc_notify/notification_enriched.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_job.platform_gc_notify_job will be updated in-place
  ~ resource "aws_glue_job" "platform_gc_notify_job" {
      ~ default_arguments         = {
          + "--enable-continuous-cloudwatch-log" = "true"
            # (19 unchanged elements hidden)
        }
      - execution_class           = "STANDARD" -> null
        id                        = "Platform / GC Notify"
        name                      = "Platform / GC Notify"
        tags                      = {}
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_object.platform_gc_notify_curated_job will be created
  + resource "aws_s3_object" "platform_gc_notify_curated_job" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-data-lake-glue-production"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "70a33f15f85c00b9b852273249263a30"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "curated/platform/gc_notify/notification_enriched.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./curated/platform/gc_notify/notification_enriched.py"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.platform_gc_notify_job will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_notify_job" {
        id                            = "platform/gc_notify/process_data.py"
        tags                          = {}
      ~ tags_all                      = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
        # (25 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + platform_gc_notify_curated_job_name = "Platform / GC Notify / Curated / Notification Enriched"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production_curated"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_notify_curated"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_notify_job"]
WARN - plan.json - main -...
```

</details>
